export const LeaguesDict = {
    'UEFA Champions League': '🇪🇺 Лига Чемпионов УЕФА 🔥',
    Bundesliga: '🇩🇪 Бундеслига',
    'Premier League': '🏴󠁧󠁢󠁥󠁮󠁧󠁿 Английская Премьер-Лига',
    'Primera Division': '🇪🇸 Ла Лига',
    'Serie A': '🇮🇹 Сериа А',
    'Ligue 1': '🇫🇷 Лига 1',

    'Primeira Liga': '🇵🇹 Примейра Лига',
    Eredivisie: '🇳🇱 Эредивизи',
    'Ukrainian Premier League': '🇺🇦 УПЛ',
    'Turkish Süper Lig': '🇹🇷 Тур. Суперлига',
    'Russian Premier League': '🇷🇺 РПЛ',
    'Belgian Pro League': '🇧🇪 Бел. Про-Лига',
    'Scottish Premier League': '🏴󠁧󠁢󠁳󠁣󠁴󠁿 Шотл. Премьер-Лига',
    'Saudi Pro League': '🇸🇦 Сауд. Про-Лига',
};

export const standingsDict = {
    Rank: 'Место',
    Squad: 'Команда',
    'Matches Played': '🆚 Матчей сыграно',
    Wins: '🏆 Победы',
    Draws: '🤝 Ничьи',
    Losses: '🚫 Поражения',
    'Goals For': '⚽️ Забитые голы',
    'Goals Against': '❌ Пропущенные голы',
    'Goal Difference': '♻️ Разница мячей',
    Points: '✅ Очки',
    'Points/Game': '♻️ Очки/Матчи',
    xG: '🔺 Ожидаемые голы (xG)',
    'xG Allowed': '🔻 Допущенные xG',
    'xG Difference': '📊 Разница xG',
    'xG Difference/90': '♻️ Разница xG/Матч',
    'Last 5': '📊 Последние 5 матчей',
    'Attendance/Game': '📈 Средняя посещаемость стадиона',
    'Top Team Scorer': '⚽️ Лучший бомбардир',
    Goalkeeper: 'Вратарь',
    Notes: '',
};

export const positionDict = {
    GK: 'Вр',

    DF: 'Защ',
    LB: 'Лз',
    RB: 'Пз',
    CB: 'Цз',
    FB: 'Лз/Пз',

    DM: 'Оп',
    MF: 'Пзщ',
    CM: 'Цпз',
    LM: 'Лпз',
    RM: 'Ппз',
    AM: 'Апз',

    WM: 'Лв/Пв',
    FW: 'Фрв',
    LW: 'Лн',
    RW: 'Пн',
};

export const playerDict = {
    Rk: 'Индекс',
    Player: 'Игрок', // full name
    Nation: 'Национальность',
    Position: '⚡️ Позиция',
    Squad: 'Клуб', // team name
    "Current age": '📆 Возраст',

    "Matches Played": '📊 Сыграно матчей', // Matches Played
    Starts: '⏳ Матчей со старта',
    Minutes: '🕒 Сыграно минут',
    "90s Played": '♻️ Среднее число минут/90', // среднее количество минут/матч
    "Yellow Cards": '🟨 Желтые карточки', // Yellow Cards
    "Red Cards": '🟥 Красные карточки', // Red Cards

    Goals: '⚽️ Голы', // goals
    Assists: '🅰️ Голевые передачи', // assists
    "Goals + Assists": '♻️ Г+П', // goals + assists
    "Non-Penalty Goals": '✅ Голы не с пенальти', // Non-Penalty Goals,

    'Penalty Kicks Made': '⚽️ Забито с пенальти',
    'Penalty Kicks Attempted': '❌ Промазано с пенальти',

    'Progressive Carries': '📊 Продвижение мяча', // Progressive Carries продвижение мяча в сторону ворот соперника
    'Progressive Passes': '📈 Передачи с продвижением',  // Progressive Passes пас с продвижением мяча в сторону ворот соперника
    'Progressive Passes Rec': '♻️ Успешные передачи с продвижением', // Progressive Passes Received успешные пасы с продвижением мяча в сторону ворот соперника

    xG: '⚽️ Ожидаемые голы (xG)',
    "Non-Penalty xG": '✅ xG без учёта пенальти (npxG)', // Non-Penalty xG
    xAG: '♻️ Ожидаемые ассисты (xAG)', // Expected Assisted goals ожидаемые ассисты
    "npxG + xAG": '📊 npxG + xAG',

    "Non-Penalty Goals + Assists/90": '📊 Голы + Ассисты без учёта пенальти',
    'xG + xAG/90': '♻️ xG + xAG',
    'npxG/90': '✅ xG без учёта пенальти (npxG)/90мин',
};